app/Models/M_Form.php

    public function AllProvinsi()
    {
        return $this->db->table('tbl_provinsi')
            ->Get()->getResultArray();
---
SELECT *
FROM `tbl_provinsi`